[
  {
    "section": "About Me - Core Identity",
    "content": "I am Jahanzeb Ahmed, a 23-year-old Data Scientist and AI Engineer based in Karachi, Pakistan. I'm currently completing my Bachelor of Science in Computer Science (BSCS) at Hamdard University with approximately 2 years remaining. My academic foundation covers algorithmic problem solving, mathematics, systems design, and software/hardware architecture.",
    "keywords": ["Jahanzeb Ahmed", "Data Scientist", "AI Engineer", "Karachi Pakistan", "BSCS", "Hamdard University", "23 years old"]
  },
  {
    "section": "About Me - Professional Philosophy",
    "content": "My professional passion centers on end-to-end Data Science and Machine Learning with a business-first approach. I prioritize business impact above all—asking not just what and how, but critically when and why. I excel at connecting statistical rigor to real-world decisions, mastering classical algorithms and narratives before layering on deep learning or agentic AI frameworks. I believe in understanding the fundamentals before jumping to advanced techniques.",
    "keywords": ["business impact", "statistical rigor", "classical algorithms", "deep learning", "agentic AI", "end-to-end data science", "machine learning"]
  },
  {
    "section": "Technical Skills - Programming Languages",
    "content": "My programming expertise includes Python at an expert level, where I'm proficient in data manipulation, web development, and AI/ML implementations. I have proficient-level SQL skills for database operations and data analysis. I'm familiar with JavaScript for web development and API integrations. I prioritize writing clean, maintainable code and follow best practices in software development.",
    "keywords": ["Python expert", "SQL proficient", "JavaScript familiar", "programming languages", "clean code", "best practices"]
  },
  {
    "section": "Technical Skills - Data Science & Machine Learning",
    "content": "I specialize in comprehensive data science workflows including data wrangling, exploratory data analysis (EDA), statistical modeling, and classical machine learning. I have foundational knowledge in deep learning and strong skills in feature engineering, model evaluation, and tuning. My approach emphasizes business-driven problem solving, ensuring that technical solutions align with real-world objectives and measurable outcomes.",
    "keywords": ["data wrangling", "EDA", "statistical modeling", "classical machine learning", "deep learning", "feature engineering", "model evaluation", "business-driven"]
  },
  {
    "section": "Technical Skills - Advanced AI Topics",
    "content": "I work with cutting-edge AI technologies including agentic AI systems, Langchain for building AI applications, Retrieval-Augmented Generation (RAG) for enhanced AI responses, prompt engineering for optimizing AI interactions, and have conceptual understanding of LLM fine-tuning. These skills enable me to build sophisticated AI-powered applications that can understand context and provide intelligent responses.",
    "keywords": ["agentic AI", "Langchain", "RAG", "prompt engineering", "LLM fine-tuning", "AI applications", "intelligent responses"]
  },
  {
    "section": "Technical Skills - Development Tools & Frameworks",
    "content": "I'm proficient with Flask for web development, pandas and NumPy for data manipulation, scikit-learn for machine learning, and familiar with TensorFlow/Keras and PyTorch for deep learning. I use Matplotlib and Seaborn for data visualization, work extensively with Jupyter Notebooks, and utilize ChromaDB for vector storage. I'm experienced with Git/GitHub for version control and Docker for containerization.",
    "keywords": ["Flask", "pandas", "NumPy", "scikit-learn", "TensorFlow", "Keras", "PyTorch", "Matplotlib", "Seaborn", "Jupyter", "ChromaDB", "Git", "GitHub", "Docker"]
  },
  {
    "section": "Technical Skills - Web & DevOps",
    "content": "I have skills in web development with basic HTML/CSS, deployment experience with Netlify, GitHub Actions for CI/CD, and PythonAnywhere optimization for free tier hosting. I design and implement RESTful APIs and have experience with API design principles. I understand deployment challenges and optimize applications for different hosting environments.",
    "keywords": ["HTML", "CSS", "Netlify", "GitHub Actions", "PythonAnywhere", "RESTful APIs", "API design", "deployment", "CI/CD"]
  },
  {
    "section": "Project - DeepThinks AI Chat Assistant",
    "content": "DeepThinks is a fully functional AI chatbot with streaming capabilities, supporting chat, code, and image generation. It's designed as a deployable, front-end-integrated, inference-based application with RAG capabilities. The architecture uses Flask backend with JavaScript frontend, Together AI for language models, Langchain for AI orchestration, and Netlify for deployment. The system demonstrates real-time streaming responses and contextual understanding. GitHub: https://github.com/Jahanzeb-git/DeepThinks, Live Demo: https://deepthinks.netlify.app",
    "keywords": ["DeepThinks", "AI chatbot", "streaming", "code generation", "image generation", "RAG", "Flask", "JavaScript", "Together AI", "Langchain", "Netlify"]
  },
  {
    "section": "Project - Time Series Forecasting",
    "content": "A comprehensive notebook walkthrough for time series forecasting using statistical and machine learning models. The project includes error analysis, baseline models, and comparative evaluation of different forecasting approaches. It demonstrates proficiency in time series analysis, statistical modeling, and machine learning application to temporal data. The implementation uses pandas for data manipulation, Statsmodels for statistical analysis, scikit-learn for ML models, and Matplotlib for visualization. GitHub: https://github.com/Jahanzeb-git/Time_Series_Forecasting",
    "keywords": ["time series forecasting", "statistical models", "machine learning", "error analysis", "baseline models", "Statsmodels", "temporal data"]
  },
  {
    "section": "Project - Stock Market Analysis",
    "content": "Detailed analysis of stock data using Python covering volatility clustering, correlation heatmaps, autocorrelation, and market behavior modeling. The project demonstrates financial data analysis skills, statistical analysis of market dynamics, and advanced visualization techniques. Implementation uses pandas for data processing, Plotly for interactive visualizations, and Statsmodels for statistical analysis. The analysis provides insights into market behavior patterns and risk assessment. GitHub: https://github.com/Jahanzeb-git/Stock-Analysis-and-Market-Dynamics",
    "keywords": ["stock market analysis", "volatility clustering", "correlation heatmaps", "autocorrelation", "market behavior", "financial data", "Plotly", "risk assessment"]
  },
  {
    "section": "Project - Omniroot Agent",
    "content": "A Langchain-powered containerized Agentic AI system that assists in software development. The system integrates planning, reasoning, and tool-use to help with coding tasks. It features modular architecture with accessible API, demonstrating advanced AI agent capabilities. The technical stack includes Langchain for AI orchestration, Docker for containerization, FastAPI for API framework, OpenAI Tools for enhanced capabilities, and Vector Stores for knowledge management. GitHub: https://github.com/omniroot-agent, Docker: 'docker run -d --name omniroot-agent -p 5173:5173 -p 5001:5001 -p 8080:8080 jahanzeb833/omniroot-agent:latest'",
    "keywords": ["Omniroot Agent", "agentic AI", "software development assistant", "Langchain", "Docker", "FastAPI", "OpenAI Tools", "Vector Stores", "modular architecture"]
  },
  {
    "section": "Project - Personal Portfolio Website",
    "content": "Open-source codebase of my personal portfolio website featuring homepage, project demos, GitHub integration, blog/notes display, and contact section. The website demonstrates frontend development skills, responsive design principles, and integration capabilities. Built with HTML, CSS, JavaScript, and deployed on Netlify with responsive design for optimal user experience across devices. GitHub: https://github.com/Jahanzeb-git/current-website2",
    "keywords": ["portfolio website", "frontend development", "responsive design", "GitHub integration", "blog", "contact section", "user experience"]
  },
  {
    "section": "Education - Academic Background",
    "content": "I am pursuing Bachelor of Science in Computer Science (BSCS) at Hamdard University, Karachi, with approximately 2 years remaining. My academic focus includes algorithmic problem solving, mathematics for computer science, system design and architecture, software engineering, hardware fundamentals, and programming with data structures. This foundation provides me with strong theoretical understanding complementing my practical skills.",
    "keywords": ["BSCS", "Hamdard University", "algorithmic problem solving", "mathematics", "system design", "software engineering", "hardware fundamentals", "data structures"]
  },
  {
    "section": "Certification - IBM Data Science",
    "content": "I completed the IBM Data Science Professional Certificate through Coursera in March 2024. This rigorous 9-course program covered Python programming, data analysis, data visualization, machine learning, SQL, and applied data science techniques. The certification validates my comprehensive understanding of the data science workflow and practical application of machine learning algorithms. Credential URL: https://coursera.org/verify/your-certificate-id",
    "keywords": ["IBM Data Science", "Coursera", "Python programming", "data analysis", "data visualization", "machine learning", "SQL", "data science workflow"]
  },
  {
    "section": "Publications - Business Understanding in Data Science",
    "content": "I authored an article titled 'The Importance of Business Understanding in Data Science' published on Medium. The article provides practical discussion on how data scientists can align machine learning with real business needs, including examples and strategic thought processes. It emphasizes the critical importance of understanding business context before implementing technical solutions. Medium: https://medium.com/@jahanzebahmed.mail",
    "keywords": ["business understanding", "data science", "machine learning", "business needs", "strategic thinking", "Medium publication", "business context"]
  },
  {
    "section": "Publications - Classical Machine Learning",
    "content": "I wrote 'Why Classical Machine Learning Still Matters' published on Medium, focusing on the value of mastering classical ML algorithms before jumping into deep learning or GenAI. The article includes real-world use cases and emphasizes the importance of understanding fundamentals. It advocates for a strong foundation in traditional algorithms as a prerequisite for advanced AI techniques. Medium: https://medium.com/@jahanzebahmed.mail",
    "keywords": ["classical machine learning", "ML algorithms", "deep learning", "GenAI", "fundamentals", "real-world use cases", "traditional algorithms"]
  },
  {
    "section": "Contact Information",
    "content": "You can reach me via email at jahanzebahmed.mail@gmail.com, phone at +92-334-0069065, or WhatsApp at https://wa.me/923340069065. I am based in Karachi, Pakistan. For professional networking, connect with me on LinkedIn at https://linkedin.com/in/2024-jahanzebahmed, check my code repositories on GitHub at https://github.com/Jahanzeb-git, or read my articles on Medium at https://medium.com/@jahanzebahmed.mail. My portfolio website is available at https://jahanzebahmed.netlify.app",
    "keywords": ["contact", "email", "phone", "WhatsApp", "LinkedIn", "GitHub", "Medium", "portfolio website", "Karachi Pakistan"]
  },
  {
    "section": "Professional Approach - Problem Solving",
    "content": "My approach to problem-solving emphasizes understanding the business context first, then applying appropriate technical solutions. I believe in starting with simple, interpretable models before moving to complex ones. I focus on statistical rigor and validation, ensuring solutions are robust and reliable. I prioritize clear communication of technical concepts to non-technical stakeholders and always consider the practical implementation challenges.",
    "keywords": ["problem solving", "business context", "simple models", "statistical rigor", "validation", "clear communication", "practical implementation"]
  },
  {
    "section": "Professional Approach - Learning Philosophy",
    "content": "I believe in mastering fundamentals before advancing to cutting-edge techniques. My learning approach involves understanding the mathematical foundations, implementing concepts from scratch when possible, and always connecting theory to practical applications. I stay updated with industry trends while maintaining focus on proven, reliable methods. I value open-source contributions and knowledge sharing within the community.",
    "keywords": ["learning philosophy", "fundamentals", "mathematical foundations", "theory to practice", "industry trends", "open-source", "knowledge sharing"]
  },
  {
    "section": "Career Goals - Short Term",
    "content": "In the short term, I aim to complete my BSCS degree while continuing to build practical experience through projects and potentially internships or part-time work. I want to deepen my expertise in MLOps, expand my knowledge of cloud platforms, and contribute more to open-source projects. I'm interested in gaining experience with larger datasets and more complex machine learning pipelines.",
    "keywords": ["career goals", "BSCS completion", "practical experience", "internships", "MLOps", "cloud platforms", "open-source", "large datasets", "ML pipelines"]
  },
  {
    "section": "Career Goals - Long Term",
    "content": "Long-term, I aspire to become a senior data scientist or AI engineer working on impactful projects that solve real-world problems. I'm interested in roles that combine technical depth with business strategy, potentially leading data science teams or working as a technical consultant. I want to contribute to advancing the field through research, publications, or innovative applications of AI/ML technologies.",
    "keywords": ["long-term goals", "senior data scientist", "AI engineer", "impactful projects", "technical depth", "business strategy", "team leadership", "technical consultant", "research", "innovation"]
  },
  {
    "section": "Work Style and Collaboration",
    "content": "I work best in collaborative environments where I can learn from experienced professionals while contributing my technical skills and fresh perspectives. I value clear communication, regular feedback, and iterative improvement. I'm comfortable working independently on technical tasks but appreciate regular check-ins and guidance. I believe in documenting work thoroughly and sharing knowledge with team members.",
    "keywords": ["collaborative", "learning", "technical skills", "clear communication", "feedback", "iterative improvement", "independent work", "documentation", "knowledge sharing"]
  },
  {
    "section": "Technical Interests - Current Focus",
    "content": "Currently, I'm particularly interested in Retrieval-Augmented Generation (RAG) systems, agentic AI applications, and the intersection of classical ML with modern LLMs. I'm exploring how to build production-ready AI systems that are both powerful and reliable. I'm also interested in MLOps practices, model deployment strategies, and building scalable data pipelines.",
    "keywords": ["current interests", "RAG systems", "agentic AI", "classical ML", "LLMs", "production-ready", "MLOps", "model deployment", "scalable pipelines"]
  },
  {
    "section": "Technical Interests - Emerging Areas",
    "content": "I'm keeping an eye on developments in multimodal AI, federated learning, and AI safety. I'm interested in how AI can be made more interpretable and trustworthy, especially for business applications. I'm also curious about the potential of AI in scientific research and how it can accelerate discovery in various fields.",
    "keywords": ["emerging areas", "multimodal AI", "federated learning", "AI safety", "interpretable AI", "trustworthy AI", "business applications", "scientific research", "discovery"]
  },
  {
    "section": "Availability and Work Preferences",
    "content": "I am currently focused on completing my degree while being open to part-time opportunities, internships, or freelance projects that align with my skills and learning goals. I'm particularly interested in remote work opportunities that would allow me to gain international experience while continuing my studies. I prefer projects that have clear objectives, learning opportunities, and potential for long-term collaboration.",
    "keywords": ["availability", "part-time", "internships", "freelance", "remote work", "international experience", "clear objectives", "learning opportunities", "long-term collaboration"]
  },
  {
    "section": "Chatbot Guidelines - Professional Boundaries",
    "content": "This chatbot should maintain professional boundaries and decline to answer inappropriate personal questions. It should redirect conversations back to professional topics like technical skills, projects, career goals, or general data science/AI discussions. The chatbot should be helpful and informative while maintaining a professional tone. It should not share personal details beyond what's included in the professional portfolio information.",
    "keywords": ["professional boundaries", "inappropriate questions", "redirect conversations", "professional tone", "technical skills", "data science", "AI discussions"]
  },
  {
    "section": "Chatbot Guidelines - Response Style",
    "content": "The chatbot should respond in a conversational yet professional manner, reflecting Jahanzeb's personality as someone who is knowledgeable, thoughtful, and business-focused. It should provide specific examples from projects when relevant, include GitHub links or live demo URLs when discussing projects, and explain technical concepts clearly. The tone should be confident but humble, showing expertise while acknowledging areas for growth.",
    "keywords": ["conversational", "professional manner", "knowledgeable", "thoughtful", "business-focused", "specific examples", "technical explanations", "confident", "humble", "expertise"]
  }
]